src/Documents/ЗадачаКурьеру/ЗадачаКурьеру.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗадачаКурьеру</name>
  <attributes>
    <name>ФИО_клиента1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСумма1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяДоставки1</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СдачаДляКурьеров1</name>
    <type>
      <types>EnumRef.Сдача</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОплаты</name>
    <type>
      <types>EnumRef.СпособОплаты</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/МаршрутныйЛист/МаршрутныйЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>МаршрутныйЛист</name>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокЗадач</name>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособОплаты</name>
      <type>
        <types>EnumRef.СпособОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сдача</name>
      <type>
        <types>EnumRef.Сдача</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЗадачаКурьеру/Forms/ФормаМаршрутногоЛиста/Module.bsl
перем ДанныеЗадачи;
	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		
		ОтборПоДоставке = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); //Добавлям отбор
		ОтборПоДоставке.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; //Как будем сравнивать
		ОтборПоДоставке.Использование = Истина; // Устанавливаем галку использованияНовый ПолеКомпоновкиДанных("Номенклатура")
		ОтборПоДоставке.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Доставлено"); //По какому реквизиту будем делать отбор
		ОтборПоДоставке.ПравоеЗначение = Ложь; // И само значение отбора    
		
		ОтборПоОбработке = ЭтаФорма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); //Добавлям отбор
		ОтборПоОбработке.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; //Как будем сравнивать
		ОтборПоОбработке.Использование = Истина; // Устанавливаем галку использованияНовый ПолеКомпоновкиДанных("Номенклатура")
		ОтборПоОбработке.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВОбработке"); //По какому реквизиту будем делать отбор
		ОтборПоОбработке.ПравоеЗначение = Ложь; // И само значение отбора    
		
		
	КонецПроцедуры
	
	&НаКлиенте
	Процедура Создать(Команда)
		парам = Null;
		ВыделенныеСтрочки = Элементы.Список.ВыделенныеСтроки;
		ПолучитьЭлементы(ВыделенныеСтрочки,парам);
		
		Форма = ПолучитьФорму("Документ.МаршрутныйЛист.ФормаОбъекта",парам);
		Форма.Открыть();
	КонецПроцедуры
	
	
	&НаСервереБезКонтекста
	Процедура ПолучитьЭлементы(ВыделенныеСтрочки,парам) 
		
		
		МаршрутныйЛист = Документы.МаршрутныйЛист.СоздатьДокумент();
		
	
		
		Для Каждого Строка Из ВыделенныеСтрочки Цикл
			Задача = Строка.ПолучитьОбъект();
			//Сообщить(Задача.СпособОплаты);
			//ДанныеЗадачи = Новый Структура("Название,Дата,Адрес,СпособОплаты,Сдача,Клиент", 
			//Задача.Ссылка,Задача.ДатаИВремяДоставки1,Задача.АдресДоставки1, 
			//Задача.СпособОплаты,Задача.СдачаДляКурьеров1,Задача.ФИО_клиента1);
			
			НоваяСтрока = МаршрутныйЛист.СписокЗадач.Добавить();	
			НоваяСтрока.Время = Задача.ДатаИВремяДоставки1;
			НоваяСтрока.Адрес =  Задача.АдресДоставки1;
			НоваяСтрока.Клиент = Задача.ФИО_клиента1;
			НоваяСтрока.Сдача =  Задача.СдачаДляКурьеров1;
			НоваяСтрока.СпособОплаты =  Задача.СпособОплаты;
			НоваяСтрока.Сумма = Задача.ИтоговаяСумма1;
			
			
		КонецЦикла;
		
	
		МаршрутныйЛист.Дата = ТекущаяДата();
		МаршрутныйЛист.Записать();

		СсылкаНаДок = МаршрутныйЛист.Ссылка;
		
		парам = новый Структура;
		парам.вставить("Ключ",СсылкаНаДок);
		КонецПроцедуры
